!pip install cx_oracle

In [ ]:
import pandas as pd
import cx_Oracle

In [6]:
# 포맷 : 사용자명, 비밀번호, 호스트이름:포트/서비스이름
db = cx_Oracle.connect("c##madang","madang","localhost:1521/xe")

cursor = db.cursor()
cursor.execute("select * from book")
x = cursor.fetchall()

df = pd.DataFrame(x)
df.head()

   0        1      2      3
0  1   축구의 역사   굿스포츠   7000
1  2  축구아는 여자    나무수  13000
2  3   축구의 이해  대한미디어  22000
3  4   골프 바이블  대한미디어  35000
4  5    피겨 교본   굿스포츠   8000

In [7]:
db = cx_Oracle.connect("c##madang","madang","localhost:1521/xe")

cursor = db.cursor()
cursor.execute("select * from book")
x = cursor.fetchall()

df = pd.DataFrame(x)

# 컬럼명 입력
cursor.execute("""select column_name from user_tab_columns where table_name = 'BOOK'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

   BOOKID BOOKNAME PUBLISHER  PRICE
0       1   축구의 역사      굿스포츠   7000
1       2  축구아는 여자       나무수  13000
2       3   축구의 이해     대한미디어  22000
3       4   골프 바이블     대한미디어  35000
4       5    피겨 교본      굿스포츠   8000

In [8]:
col

[('BOOKID',), ('BOOKNAME',), ('PUBLISHER',), ('PRICE',)]

In [9]:
for i in col:
    for j in i:
        col_new.append(j)
col_new

['BOOKID',
 'BOOKNAME',
 'PUBLISHER',
 'PRICE',
 'BOOKID',
 'BOOKNAME',
 'PUBLISHER',
 'PRICE']

In [10]:
cursor.close()
db.close()

## Q.
hr 사용자를 적용하면 원하는 테이블을 가져와서 df로 출력하세요(컬럼명 포함)

In [12]:
db = cx_Oracle.connect("c##hr","hr","localhost:1521/xe")

cursor = db.cursor()
cursor.execute("select * from jobs")
x = cursor.fetchall()

df = pd.DataFrame(x)

# 컬럼명 입력
cursor.execute("""select column_name from user_tab_columns where table_name = 'JOBS'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

       JOB_ID                      JOB_TITLE  MIN_SALARY  MAX_SALARY
0     AD_PRES                      President       20080       40000
1       AD_VP  Administration Vice President       15000       30000
2     AD_ASST       Administration Assistant        3000        6000
3      FI_MGR                Finance Manager        8200       16000
4  FI_ACCOUNT                     Accountant        4200        9000

In [13]:
cursor.close()
db.close()

In [17]:
# create
db = cx_Oracle.connect("c##hr","hr","localhost:1521/xe")
cs = db.cursor()
sql = "create table sample(id varchar2(10), score number)"
cs.execute(sql)
#cs.close()
#db.commit()
#db.close()

DatabaseError: ORA-00955: 기존의 객체가 이름을 사용하고 있습니다.

In [16]:
# insert
def insert(t):
    db = cx_Oracle.connect("c##madang", "madang","localhost:1521/xe")
    cs = db.cursor()
    sql = "insert into sample1(id, score) values (:1, :2)"
    cs.execute(sql, t)
    db.commit()
    db.close()

insert(('9','1'))

DatabaseError: ORA-00942: 테이블 또는 뷰가 존재하지 않습니다

In [18]:
db = cx_Oracle.connect("c##cakd7", "cakd7","localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from demo")
x = cursor.fetchall()

df = pd.DataFrame(x)

# 컬럼명 입력
cursor.execute("""select column_name from user_tab_columns where table_name = 'DEMO'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

  CUSTNO GENDER    AGE AREA
0  00251      F  60세이상  100
1  00252      F  60세이상  016
2  00253      M  60세이상  100
3  00254      F  60세이상  043
4  00255      F  60세이상  460

In [19]:
df.shape

(19383, 4)

In [20]:
df.AGE.value_counts()

45세~49세    4082
40세~44세    3677
50세~54세    3114
35세~39세    2769
55세~59세    1774
30세~34세    1679
60세이상      1303
25세~29세     685
20세~24세     283
19세이하        17
Name: AGE, dtype: int64

In [21]:
cursor.close()
db.close()

### 과제_1012_1 
purprd 테이블을 가져와서 다음사항을 수행하세요
- pivot_table 을 이용해서 고객번호별 대분류별 구매금액을 도출
- 고객별 구매관련 의미있는 인사이트를 뽑아낼 수 있는 데이터 셋을 출력 (2개 이상)

In [23]:
db = cx_Oracle.connect("c##cakd7", "cakd7","localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from PURPRD")
x = cursor.fetchall()

df = pd.DataFrame(x)

# 컬럼명 입력
cursor.execute("""select column_name from user_tab_columns where table_name = 'PURPRD'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

MemoryError: Unable to allocate 2.13 GiB for an array with shape (28593030, 10) and data type object